АПК/Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Comment>Список проектов студии</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтапПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРеализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заказчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиПроекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

АПК/Catalogs/Проекты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытйФормы

&НаКлиенте
Процедура УчастникиПроектаСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УчастникиПроекта.ТекущиеДанные;
	
	Совпадений = 0;
	
	Для Каждого ЭлементТаблицы Из Объект.УчастникиПроекта Цикл 
		
		Если ЭлементТаблицы.Сотрудник = ТекущиеДанные.Сотрудник Тогда 
			Совпадений = Совпадений + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Совпадений > 1 Тогда 
		
		Объект.УчастникиПроекта.Удалить(ТекущиеДанные);
		//Объект.УчастникиПроекта.Добавить();
		
		ВызватьИсключение("Данный сотрудник уже задействован в проекте!");		
		
	КонецЕсли;
	
	НужныйОтдел = ТекущиеДанные.Сотрудник.Отдел;
	ТекущиеДанные.Отдел = НужныйОтдел;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = Объект.Наименование;
	
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		Элементы.Наименование.Видимость = Ложь;
		Элементы.ОтредактироватьНазвание.Видимость = Истина;
		Элементы.ФормаПодтвердитьИзменения.Видимость = Ложь;
		
	КонецЕсли;
	
	ЭтапПроектаПриИзмененииНаСервере();
		
КонецПроцедуры

// Старый код модуля:
//Элементы.ПрогрессБар_1.Видимость = Ложь;
//Элементы.ПрогрессБар_2.Видимость = Ложь;
//Элементы.ПрогрессБар_3.Видимость = Ложь;
//Элементы.ПрогрессБар_4.Видимость = Ложь;
//Элементы.ПрогрессБар_5.Видимость = Ложь;
//Элементы.ПрогрессБар_6.Видимость = Ложь;
//Элементы.ПрогрессБар_7.Видимость = Ложь;
//Элементы.ПрогрессБар_8.Видимость = Ложь;
//Элементы.ПрогрессБар_9.Видимость = Ложь;
//Если КодЭтапа = "1" Тогда 
//	Элементы.ПрогрессБар_1.Видимость = Истина;
//ИначеЕсли КодЭтапа = "2" Тогда 
//	Элементы.ПрогрессБар_2.Видимость = Истина;
//ИначеЕсли КодЭтапа = "3" Тогда 
//	Элементы.ПрогрессБар_3.Видимость = Истина;
//ИначеЕсли КодЭтапа = "4" Тогда 
//	Элементы.ПрогрессБар_4.Видимость = Истина;
//ИначеЕсли КодЭтапа = "5" Тогда 
//	Элементы.ПрогрессБар_5.Видимость = Истина;
//ИначеЕсли КодЭтапа = "6" Тогда 
//	Элементы.ПрогрессБар_6.Видимость = Истина;
//ИначеЕсли КодЭтапа = "7" Тогда 
//	Элементы.ПрогрессБар_7.Видимость = Истина;
//ИначеЕсли КодЭтапа = "8" Тогда 
//	Элементы.ПрогрессБар_8.Видимость = Истина;
//ИначеЕсли КодЭтапа = "9" Тогда 
//	Элементы.ПрогрессБар_9.Видимость = Истина;
//КонецЕсли;
//Для Номер = 1 По 9 Цикл 	
//	Элементы["ПрогрессБар_" + Номер].Видимость = Ложь;	
//КонецЦикла;
//	
//// Так как этапов всего 9, проверка для прогресс бара будет через код
//КодЭтапа = Объект.ЭтапПроекта.Код;
//
//Если КодЭтапа >= 1 И КодЭтапа <= 9 Тогда 
//	Элементы["ПрогрессБар_" + КодЭтапа].Видимость = Истина;
//КонецЕсли;
&НаСервере
Процедура ЭтапПроектаПриИзмененииНаСервере()
			
	Элементы.ПрогрессБар.Видимость = Ложь;
	
	КодЭтапа = Объект.ЭтапПроекта.Код;
	
	Если КодЭтапа >= 1 И КодЭтапа <= 9 Тогда
		
		Элементы.ПрогрессБар.Картинка = БиблиотекаКартинок["ПрогрессБар_" + КодЭтапа];
		Элементы.ПрогрессБар.Видимость = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПроектаПриИзменении(Элемент)
	ЭтапПроектаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Отказ = Ложь;
	СтандартнаяОбработка = Истина;
	
	ПриСозданииНаСервере(Отказ, СтандартнаяОбработка); 
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ОтредактироватьНазвание(Команда)	
	
	Элементы.Наименование.Видимость = Истина;
	Элементы.ОтредактироватьНазвание.Видимость = Ложь;
	Элементы.ФормаПодтвердитьИзменения.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьИзмененияНаСервере()
	
	Отказ = Ложь;
	СтандартрнаяОбработка = Истина;
	
	ЭтотОбъект.Записать();
	Элементы.ОтредактироватьНазвание.Видимость = Истина;
		
	ПриСозданииНаСервере(Отказ, СтандартрнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИзменения(Команда)
	ПодтвердитьИзмененияНаСервере();
КонецПроцедуры

#КонецОбласти
